adafruit/circuitpython/ports/raspberrypi/boards/dck01/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "DCK02"
#define MICROPY_HW_MCU_NAME "rp2040"

// Status LED
#define MICROPY_HW_LED_STATUS (&pin_GPIO4)

#define DEFAULT_UART_BUS_TX (&pin_GPIO0)
#define DEFAULT_UART_BUS_RX (&pin_GPIO1)

#define DEFAULT_I2C_BUS_SDA (&pin_GPIO2)
#define DEFAULT_I2C_BUS_SCL (&pin_GPIO3)

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO14)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO15)
#define DEFAULT_SPI_BUS_MISO (&pin_GPIO12)
